/* Задача 3. Не пара
Преподаватели Geek Brains создали набор, содержащий N (1 ≤ N ≤ 1 000 000) натуральных чисел, не
превосходящих 1 000 000. Известно, что ровно одно число в этом наборе встречается один раз, а остальные
— ровно по два раза. Помогите им найти это число. Входные данные: в первой входной строке вводится
число N, затем по одному числу в строке вводятся N натуральных чисел, не превосходящих 2 000 000 000.
Выходные данные: ваша программа должна определить число, встречающееся один раз, и вывести его на
экран.
Указание: использовать массивы запрещается.
Данные на входе: Натуральное число N (N > 0), после которого следует последовательность из N
целых чисел.
Данные на выходе: Одно целое число.
Пример No1
Данные на входе:3 12 15 12
Данные на выходе:15
Пример No2
Данные на входе:512021
Данные на выходе:0 
*/

#include <stdio.h>

int main() {
    int N;
    scanf("%d", &N);
    
    int result = 0;
    
    for (int i = 0; i < N; i++) {
        int num = 0;
        scanf("%d", &num);
        result = result ^ num;
    }
    
    printf("%u\n", result);
    
    return 0;
}
